# ProfileCrossesRevolutionAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevolutionFailures..::..ProfileCrossesRevolutionAxis Property
BuiltInFailures..::..RevolutionFailures Class See Also
---
The profile must not cross the axis of revolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProfileCrossesRevolutionAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileCrossesRevolutionAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProfileCrossesRevolutionAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevolutionFailures Class
Autodesk.Revit.DB Namespace